;---------------------------------------------------------------------------------------
;  FILE:   XcomLoco                                  
;  
;	File created by RustyDios	24/11/19	02:45
;	LAST UPDATED				08/03/21	16:00
;
;	Xenolator descriptions
;
;*******************************************************************************************

;*********************
;能力-调整
;*********************

[MZFireThrowerOverwatchShot X2AbilityTemplate]
LocFriendlyName="献祭监视"

[MZChemthrowerSuppresion X2AbilityTemplate]
LocFriendlyName="献祭压制"

[MZChemthrowerKillZoneShot X2AbilityTemplate]
LocFriendlyName="献祭杀戮"

;********************
;能力 - 新
;********************

[RDThrowerShot_Fire X2AbilityTemplate]
LocFriendlyName="火焰喷射器射击"
LocLongDescription="喷射出一股高度易燃的化学物质，燃烧并破坏多个目标."
LocHelpText="喷射出一股高度易燃的化学物质，燃烧并破坏多个目标."
LocFlyOverText="火焰喷射器射击"
LocPromotionPopupText="<Bullet/>喷射出一股高度易燃的化学物质，燃烧并破坏多个目标."

[RDThrowerShot_Acid X2AbilityTemplate]
LocFriendlyName="酸液喷射器射击"
LocLongDescription="喷射出一股腐蚀性很强的化学物质，燃烧并撕碎多个目标."
LocHelpText="喷射出一股腐蚀性很强的化学物质，燃烧并撕碎多个目标."
LocFlyOverText="酸液喷射器射击"
LocPromotionPopupText="<Bullet/>喷射出一股腐蚀性很强的化学物质，燃烧并撕碎多个目标."

[RDThrowerShot_Poison X2AbilityTemplate]
LocFriendlyName="毒雾喷射器射击"
LocLongDescription="喷射出一股剧毒化学物质，使多个目标中毒。穿透盔甲."
LocHelpText="喷射出一股剧毒化学物质，使多个目标中毒。穿透盔甲."
LocFlyOverText="毒雾喷射器射击"
LocPromotionPopupText="<Bullet/>喷射出一股剧毒化学物质，使多个目标中毒。穿透盔甲."

[RDThrowerOverwatchShot_Fire X2AbilityTemplate]
LocFriendlyName="火焰喷射器监视"

[RDThrowerOverwatchShot_Acid X2AbilityTemplate]
LocFriendlyName="酸液喷射器监视"

[RDThrowerOverwatchShot_Poison X2AbilityTemplate]
LocFriendlyName="毒雾喷射器监视"

[RDChemstorm_Acid X2AbilityTemplate]
LocFriendlyName="酸雾"
LocLongDescription="使用<Ability:WeaponName/>攻击<Ability:ClassName/>所在位置为中心圆形范围内所有目标."
LocHelpText="使用<Ability:WeaponName/>攻击<Ability:ClassName/>所在位置为中心圆形范围内所有目标."
LocFlyOverText="酸雾"
LocPromotionPopupText="<Bullet/>使用<Ability:WeaponName/>攻击<Ability:ClassName/>所在位置为中心圆形范围内所有目标.<br/><Bullet/>消耗<Ability:CHEMSTORM_AMMO/>弹药.<br/><Bullet/>需要<Ability:CHEMSTORM_COOL/>回合冷却.<br/><Bullet/>范围:<Ability:CHEMSTORM_RADIUS/>格."

[RDChemstorm_Poison X2AbilityTemplate]
LocFriendlyName="毒雾"
LocLongDescription="使用<Ability:WeaponName/>攻击<Ability:ClassName/>所在位置为中心圆形范围内所有目标."
LocHelpText="使用<Ability:WeaponName/>攻击<Ability:ClassName/>所在位置为中心圆形范围内所有目标."
LocFlyOverText="毒雾"
LocPromotionPopupText="<Bullet/>使用<Ability:WeaponName/>攻击<Ability:ClassName/>所在位置为中心圆形范围内所有目标.<br/><Bullet/>消耗<Ability:CHEMSTORM_AMMO/>弹药.<br/><Bullet/>需要<Ability:CHEMSTORM_COOL/>回合冷却.<br/><Bullet/>范围:<Ability:CHEMSTORM_RADIUS/>格."


[XENOLATOR_Directed X2AbilityTemplate]
LocFriendlyName="定向喷射"
LocLongDescription="喷射出一条直线火焰。这条火焰线将造成严重烧伤，并随着时间的推移造成更高的伤害."
LocHelpText="喷射出一条直线火焰。这条火焰线将造成严重烧伤，并随着时间的推移造成更高的伤害."
LocFlyOverText="定向喷射"

[XENOLATOR_FlameArea X2AbilityTemplate]
LocFriendlyName="火焰爆发"
LocLongDescription="在狭小紧凑的区域内喷射火焰。筑起一道火焰墙，驱散敌人."
LocHelpText="在狭小紧凑的区域内喷射火焰。筑起一道火焰墙，驱散敌人."
LocFlyOverText="火焰爆发"

[XENOLATOR_ArcCutter X2AbilityTemplate]
LocFriendlyName="电弧切割"
LocLongDescription="使用<Ability:WeaponName/>撕碎盔甲，同时对目标造成燃烧伤害。\n对机械单位造成额外伤害，并有机会将其强制关机."
LocHelpText="使用<Ability:WeaponName/>撕碎盔甲，同时对目标造成燃烧伤害。\n对机械单位造成额外伤害，并有机会将其强制关机."
LocFlyOverText="电弧切割"

;**********
; Weapons
;**********

[XCOM_Xenolator_CV X2WeaponTemplate]
FriendlyName="基础火焰喷射器"
FriendlyNamePlural="基础火焰喷射器"
BriefSummary="喷射器可以喷射出一股高度易燃的化学物质，燃烧并破坏多个目标."
TacticalText="<Bullet/>喷射器在开阔地能造成的伤害很低，只有在对付密集的多个目标时才颇具威力.<br> <Bullet/>喷射器会点燃目标，造成伤害并使一些能力失效。<br><Bullet/>一些敌人可能对火免疫，并且不会受到火焰喷射器的伤害。<br><Bullet/>对失落者格外有效<br>"
AbilityDescName="火焰喷射器"

[XCOM_Xenolator_MG X2WeaponTemplate]
FriendlyName="高级火焰喷射器"
FriendlyNamePlural="Advanced Xenolators"
BriefSummary="喷射器可以喷射出一股高度易燃的化学物质，燃烧并破坏多个目标."
TacticalText="<Bullet/>喷射器在开阔地能造成的伤害很低，只有在对付密集的多个目标时才颇具威力.<br> <Bullet/>喷射器会点燃目标，造成伤害并使一些能力失效。<br><Bullet/>一些敌人可能对火免疫，并且不会受到火焰喷射器的伤害。<br><Bullet/>对失落者格外有效<br>"
AbilityDescName="火焰喷射器"

[XCOM_Xenolator_BM X2WeaponTemplate]
FriendlyName="先进火焰喷射器"
FriendlyNamePlural="先进火焰喷射器"
BriefSummary="喷射器可以喷射出一股高度易燃的化学物质，燃烧并破坏多个目标."
TacticalText="<Bullet/>喷射器在开阔地能造成的伤害很低，只有在对付密集的多个目标时才颇具威力.<br> <Bullet/>喷射器会点燃目标，造成伤害并使一些能力失效。<br><Bullet/>一些敌人可能对火免疫，并且不会受到火焰喷射器的伤害。<br><Bullet/>对失落者格外有效<br>"
AbilityDescName="火焰喷射器"

[XCOM_Xenolator_AC X2WeaponTemplate]
FriendlyName="先进酸液喷射器"
FriendlyNamePlural="先进酸液喷射器"
BriefSummary="喷射出一股腐蚀性很强的化学物质，燃烧并撕碎多个目标."
TacticalText="<Bullet/>喷射器在开阔地能造成的伤害很低，只有在对付密集的多个目标时才颇具威力.<br> <Bullet/>喷射器灼烧目标，造成伤害并撕碎护甲。<br><Bullet/>一些敌人可能对酸免疫，并且不会受到酸液喷射器的伤害。<br><Bullet/>这种喷射器极难操作，其效果可能蔓延到意料外区域<br>"
AbilityDescName="酸液喷射器"

[XCOM_Xenolator_PO X2WeaponTemplate]
FriendlyName="先进毒液喷射器"
FriendlyNamePlural="先进毒液喷射器"
BriefSummary="喷射出一股剧毒化学物质，使多个目标中毒.无视护甲."
TacticalText="<Bullet/> 喷射器在开阔地能造成的伤害很低，只有在对付密集的多个目标时才颇具威力.<br> <Bullet/>喷射器会使目标中毒,造成伤害并无视护甲.<br> <Bullet/>一些敌人可能对毒免疫，并且不会受到毒液喷射器的伤害.<br> <Bullet/>这种喷射器极难操作，其效果可能蔓延到意料外区域.<br>"
AbilityDescName="毒液喷射器"

;**********
; Techs
;**********
[ExperimentalChemthrower X2TechTemplate]
DisplayName="实验化学抛掷器"
CodeName="除锈器"
Summary="我们可能看到外星人和变种人在使用了一些特殊的化学武器. 根据我们目前在制造和改装武器方面的经验，我们可以开发出不同于默认型号的新型化学喷射器。\n这些新型化学喷射器将基于火、冰、毒或酸。\n\n<font color='#5CC3C1'>****</font>\n<font color='#5CC3C1'>必须先解锁寒霜协议,才能使用冷冻器.</font>"
LongDescription="我们可能看到外星人和变种人在使用了一些特殊的化学武器. 根据我们目前在制造和改装武器方面的经验，我们可以开发出不同于默认型号的新型化学喷射器。\n这些新型化学喷射器将基于火、冰、毒或酸。\n\n<font color='#5CC3C1'>****</font>\n<font color='#5CC3C1'>必须先解锁寒霜协议,才能使用冷冻器.</font>"
UnlockedDescription="我们可以尝试修改我们的化学喷射器来制造元素变异型号"

[ExperimentalCanisters X2TechTemplate]
DisplayName="实验化合罐"
CodeName="生锈的罐"
Summary="我们可能看到外星人和变种人在使用了一些特殊的化学武器. 根据我们目前在制造和改装武器方面的经验，我们可以开发出不同于默认型号的新型化学喷射器。\n这些新型化合罐将基于 火、冰、毒、酸、电、灵能、爆炸、烟雾或医疗。\n\n<font color='#5CC3C1'>****</font>\n<font color='#5CC3C1'>必须先解锁寒霜协议,才能使用冷冻器.</font>"
LongDescription="我们可能看到外星人和变种人在使用了一些特殊的化学武器. 根据我们目前在制造和改装武器方面的经验，我们可以开发出不同于默认型号的新型化学喷射器。\n这些新型化合罐将基于 火、冰、毒、酸、蓝屏、灵能、爆炸、烟雾或医疗。\n\n<font color='#5CC3C1'>****</font>\n<font color='#5CC3C1'>必须先解锁寒霜协议,才能使用冷冻器.</font>"
UnlockedDescription="我们可以尝试修改我们的化合罐来制造元素变异型号"

;*******
; PGOv2
;*******
[MZBlastCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 爆炸"
Summary="我们做了一个特殊的化合罐."

[MZFireCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 火"
Summary="我们做了一个特殊的化合罐."

[MZIceCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 冰"
Summary="我们做了一个特殊的化合罐."

[MZPoisonCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 毒"
Summary="我们做了一个特殊的化合罐."

[MZAcidCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 酸"
Summary="我们做了一个特殊的化合罐."

[MZCurseCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 灵能"
Summary="我们做了一个特殊的化合罐."

[MZSmokeCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 烟雾"
Summary="我们做了一个特殊的化合罐."

[MZMedicCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 医疗"
Summary="我们做了一个特殊的化合罐."

[MZBluescreenCanister_UnlockTech X2TechTemplate]
DisplayName="实验化合罐: 蓝屏"
Summary="我们做了一个特殊的化合罐."

[XCOM_Xenolator_BM_UnlockTech X2TechTemplate]
DisplayName="实验化学喷射器: 火焰喷射器"
Summary="我们做了一个特殊的化学喷射器."

[XCOM_Xenolator_PO_UnlockTech X2TechTemplate]
DisplayName="实验化学喷射器: 毒液喷射器"
Summary="我们做了一个特殊的化学喷射器."

[XCOM_Xenolator_AC_UnlockTech X2TechTemplate]
DisplayName="实验化学喷射器: 酸液喷射器"
Summary="我们做了一个特殊的化学喷射器."

[XcomCryolator_BM_UnlockTech X2TechTemplate]
DisplayName="实验化学喷射器: 冷冻器"
Summary="我们做了一个特殊的化学喷射器."
